I copied your code verbatim:
```
Terraform will perform the following actions:

  # unleash_project.new_project will be created
  + resource "unleash_project" "new_project" {
      + description = "Project sample"
      + id          = "newproject"
      + mode        = (known after apply)
      + name        = "New project"
    }

  # unleash_project_environment.development_environment will be created
  + resource "unleash_project_environment" "development_environment" {
      + change_requests_enabled = (known after apply)
      + environment_name        = "development"
      + project_id              = "newproject"
      + required_approvals      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

unleash_project.new_project: Creating...
unleash_project.new_project: Creation complete after 1s [id=newproject]
unleash_project_environment.development_environment: Creating...
╷
│ Error: Unable to call api PUT https://us.app.unleash-hosted.com/elowen/api/admin/projects/newproject/environments/development/change-requests/config
│
│   with unleash_project_environment.development_environment,
│   on projects.tf line 69, in resource "unleash_project_environment" "development_environment":
│   69: resource "unleash_project_environment" "development_environment" {
│
│ 404 Not Found
╵
╷
│ Error: Unexpected HTTP error code received 404 Not Found
│
│   with unleash_project_environment.development_environment,
│   on projects.tf line 69, in resource "unleash_project_environment" "development_environment":
│   69: resource "unleash_project_environment" "development_environment" {
│
│ Calling API PUT https://us.app.unleash-hosted.com/elowen/api/admin/projects/newproject/environments/development/change-requests/config
│ Expected [204 409], got 404
│ {{"id":"5b5a376c-1883-4d70-8edf-98a9de7bc70b","name":"NotFoundError","message":"The path you were looking for (/elowen/api/admin/projects/newproject/environments/development/change-requests/config) is not
│ available.","details":[{"message":"The path you were looking for (/elowen/api/admin/projects/newproject/environments/development/change-requests/config) is not available."}]}}
╵
Releasing state lock. This may take a few moments...
```